#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
【基础题】：

    给定一个 3 * 3 的九宫格和 1 - 9 九个数字，将 9 个数字按照一定的规则填充进九宫格内，
    使九宫格内横、竖、斜每条线的和都相等，输出至少一种结果。

【附加题】：

    给定一个正整数 N（N >= 1），将 1 - N^2 填充到 N * N 的格子中，
    使横、竖、斜（对角线）每条线的和都相等，输出至少一种组合。
    比如 N 等于 3 时就是 9 宫格， N 等于 4 时为 16 宫格。
"""


def jiugongge():
    """
    >>>jiugongge()
    4 9 2
    3 5 7
    8 1 6
    """
    pass


def jiugongge(n):
    """
    >>>jiugongge(n=3)
    4 9 2
    3 5 7
    8 1 6
    >>>jiugongge(n=4)
    16 2  3  13
    5  11 10 8
    9  7  6  12
    4  14 15 1
    """
    pass
