#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
【基础题】：

    昏暗的王者峡谷丛林中，窜动着一个忙碌的身影。
    辛勤的韩信走过一个个月牙形的谷地，青筋爆出的手背，淌着红色鲜血的透甲枪，无双国士驰骋在危机四伏的森林里。
    正义，不过是胜利的又一个别称！
    手起，枪出，冰冷的寒光。
    可怜的神奇双侠倒在了血泊之中。

    十分钟之后，韩信带着 10000 金币和纠结，来到了神秘的古老商店，他仅有如下装备选择：

        影忍之足 - 690
        巨人之握 - 1500
        破甲弓 - 2100
        泣血之刃 - 1740
        无尽战刃 - 2140
        贤者的庇护 - 2080

    在不考虑装备重复的情况之下，即可以多次购买一件装备，要填满六格物品栏，有多少种购买方式？
    写一个程序，输出所有可行的购买组合。

【附加题】：

    1.如果没有6格物品栏限制，有多少种购买方式？
    2.在 1 的前提下，影忍之足最多购买一次，有多少种购买方式？
"""